<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-display-version","backend_type":"remote","backend":"120b6842e978d12f20e33e4ec5d54aa504821bbb7558dbaf5d7c654f2ccd2a7e","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #156 at https://github.com/scidsg/hushline/actions/runs/10063720413","plan_out_hash":"bbdf8408a071445c83a3243b4084de8ea9be2a69529b2ac7282721eeb1ec3b9a","plan_hash":"42c69199cdf5119cf0f4311cf961b0cf68a5c76558b3aac45d85c68f6112005c","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-display-version__ workspace<details open><summary>With variables</summary>

```hcl
branch = "display-version"
name   = "hushline-dev-display-version"
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_project.hush_line_dev will be created
+   resource "digitalocean_project" "hush_line_dev" {
+       created_at  = (known after apply)
+       description = "Development instance based on the display-version branch"
+       environment = "Development"
+       id          = (known after apply)
+       is_default  = false
+       name        = "hushline-dev-display-version"
+       owner_id    = (known after apply)
+       owner_uuid  = (known after apply)
+       purpose     = "Web Application"
+       resources   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = (known after apply)
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains  = (known after apply)
+           features = [
+               "buildpack-stack=ubuntu-22",
            ]
+           name     = "hushline-dev-display-version"
+           region   = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "app"
+               run_command        = (known after apply)

+               github {
+                   branch         = "display-version"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #156](https://github.com/scidsg/hushline/actions/runs/10063720413)